{"id":"4f546430-a2af-11ec-a58c-e500e1b21ef5","updated_at":"2022-03-13T09:24:00.131Z","updated_by":"elastic","created_at":"2022-03-13T09:23:58.113Z","created_by":"elastic","name":"Malicious file upload","tags":["Web","Apache","Malicious file upload"],"interval":"5m","enabled":true,"description":"Malicious file upload","risk_score":73,"severity":"high","license":"","output_index":".siem-signals-default","meta":{"from":"5m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-600s","rule_id":"10064056-8f5a-4c82-beef-53bed71da389","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["apache*"],"query":"any where virustotal.positives > 1","filters":[],"throttle":"no_actions","actions":[]}
{"id":"4f59e270-a2af-11ec-a58c-e500e1b21ef5","updated_at":"2022-03-14T17:09:06.982Z","updated_by":"elastic","created_at":"2022-03-13T09:23:58.111Z","created_by":"elastic","name":"Brute force attack","tags":["brute force","web","apache"],"interval":"2m","enabled":true,"description":"Brute force attacks","risk_score":73,"severity":"high","license":"","output_index":".siem-signals-default","meta":{"from":"3m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-300s","rule_id":"685a572c-6b96-468f-b467-e3d59dbec295","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":9,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["apache*"],"query":"sequence by source.ip\n[ any where url.original like~ \"/manager*\" and  http.response.status_code == 401 ] with runs = 3\nuntil [ any where http.response.status_code == \"200\"  or http.response.status_code == \"302\" ] \n","filters":[],"throttle":"no_actions","actions":[]}
{"id":"4f550070-a2af-11ec-a58c-e500e1b21ef5","updated_at":"2022-03-14T18:23:44.609Z","updated_by":"elastic","created_at":"2022-03-13T09:23:58.116Z","created_by":"elastic","name":"Command execution","tags":[],"interval":"1m","enabled":true,"description":"Command execution based on keywords","risk_score":73,"severity":"high","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-120s","rule_id":"cf99f6ed-eea2-4b63-a0e9-80d3cce0c22b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":17,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["apache*"],"query":"any where url.query like~ (\"*ls*\",\"*whoami*\",\"*cat%20*\",\"*cat+*\",\"*cd+*\",\"*cd%20*\",\"*echo+*\",\"*echo%20*\",\"*netstat*\",\"*/../*\",\"*bash*\",\"*/sh*\",\"*.sh\",\"*grep*\",\"*pwd*\",\"*uname*\")","filters":[],"throttle":"no_actions","actions":[]}
{"exported_count":3,"exported_rules_count":3,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
